InformationRegisters/КодыВесовогоТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КодыВесовогоТовара</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыВесовогоТовара/Ext/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью"
//
// Параметры
//  Отказ     – <Булево>
//            – признак отказа от записи набора регистра сведений. Если в теле
//              процедуры-обработчика установить данному параметру значение 
//              Истина, запись выполнена не будет.
//
//  Замещение – <Булево>
//            – режим записи набора; Истина - запись осуществляется с заменой
//              существующих в базе данных записей набора.Ложь - запись
//              осуществляется с "дописыванием" текущего набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)

	Перем Ошибки;
	Перем Ошибка;
	Перем ЗаписьРегистра;
	Перем Регистр;

	Если Не ОбменДанными.Загрузка Тогда
		Ошибки  = "";

		Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл
			Ошибка = КорректнаяЗапись(ЗаписьРегистра.Номенклатура,
			                          ЗаписьРегистра.Код,
			                          ЗаписьРегистра.Качество,
			                          ЗаписьРегистра.СерияНоменклатуры,
			                          ЗаписьРегистра.ХарактеристикаНоменклатуры);
			Если Не ПустаяСтрока(Ошибка) Тогда
				Если Не ПустаяСтрока(Ошибки) Тогда
					Ошибки = Ошибки + "
					                  |";
				КонецЕсли;
				Ошибки = Ошибки + НСтр("ru='Запись с кодом ';uk='Запис з кодом '")
				                + Формат(ЗаписьРегистра.Код, "ЧЦ=5; ЧДЦ=0; ЧН=0")
				                + ":
				                  |"
				                + Ошибка;
			КонецЕсли;
		КонецЦикла;

		Если Не ПустаяСтрока(Ошибки) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='При попытке записи обнаружены следующие ошибки:"
"';uk='При спробі запису виявлені наступні помилки:"
"'") + Ошибки);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция осуществляет проверку корректности записи регистра сведений
//
// Параметры
//  Номенклатура    – <СправочникСсылка.Номенклатура>
//                  – значение ресурса "Номенклатура"
//
//  Код             – <Число>
//                  – значение измерения "Код"
//
//  Качество        – <СправочникСсылка.Качество>
//                  – значение ресурса "Качество"
//
//  Серия           – <СправочникСсылка.СерииНоменклатуры>
//                  – значение ресурса "СерияНоменклатуры"
//
//  Характеристика  – <СправочникСсылка.ХарактеристикиНоменклатуры>
//                  – значение ресурса "ХарактеристикаНоменклатуры"
//
// Возвращаемое значение:
//  <Строка>        – описание ошибок или пустая строка в случае успеха
//
Функция КорректнаяЗапись(Номенклатура, Код, Качество, Серия, Характеристика)

	Перем Ошибки;
	Перем Запрос;

	Если НЕ ЗначениеЗаполнено(Код) Тогда
		Ошибки = НСтр("ru=' - Значение кода не может быть нулевым.';uk=' - Значення коду не може бути нульовим.'");
	Иначе
		Ошибки = "";
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Ошибки = НСтр("ru=' - Не задана номенклатура.';uk=' - Не задана номенклатура.'");
	Иначе
		Ошибки = "";
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	1
	|ИЗ
	|	РегистрСведений.КодыВесовогоТовара КАК КодыВесовогоТовара
	|ГДЕ
	|	КодыВесовогоТовара.Номенклатура                 = &Номенклатура
	|	И КодыВесовогоТовара.ХарактеристикаНоменклатуры = &Характеристика
	|	И КодыВесовогоТовара.Качество                   = &Качество
	|	И КодыВесовогоТовара.СерияНоменклатуры          = &Серия");

	Запрос.УстановитьПараметр("Номенклатура",   Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Качество",       Качество);
	Запрос.УстановитьПараметр("Серия",          Серия);

	Если Не Запрос.Выполнить().Пустой() Тогда
		Если Не ПустаяСтрока(Ошибки) Тогда
			Ошибки = Ошибки + "
			                  |";
		КонецЕсли;
		Ошибки = Ошибки + НСтр("ru=' - Код весового товара с таким набором параметров уже задан.';uk=' - Код вагового товару з таким набором параметрів вже заданий.'");
	КонецЕсли;

	Возврат Ошибки;

КонецФункции // КорректнаяЗапись()
